[LanguageFile]

// Specify what version of Circle Dock this language file is intended for. Used to check for validity.
CircleDockVersion=0.9.2 Alpha 8

// LanguageFileVersion is for the language file author's use. Circle Dock does not care what value this is.
LanguageFileVersion=0.9

LanguageName=Hungarian (magyar)

FileAuthor=Zoltan Toldy (AppTransTeam Hungary)

[General]
CircleDockName=Circle Dock
CircleDockWebsiteWord=Circle Dock Weboldala
GeneralWebsite=http://circledock.wikidot.com
HelpWebsite=http://circledock.wikidot.com/help-faq
AuthorWord=Szerző
SupportForumWord=Tanácsadó fórum
SupportForumWebsite=http://www.donationcoder.com/Forums/bb/index.php?board=240.0
RotationSensitivity=Key Presses / Mouse Wheel Scrolls Per Rotation
IconReplacementMode=Ikonok áthelyezhetősége
normal=Normál
topmost=Legfelül
alwaysOnBottom=Mindig alul
zLevel=Z - Level

[MainContextMenu]
WebsiteWord=Weboldal
SettingsWord=Beállítások
HideWord=Elrejtés
ShowWord=Megjelenítés
QuitWord=Kilépés
RemoveWord=Eltávolítás
AddWord=Hozzáadás
DockFolder=Dokk mappa
ChangeIcon=Ikon módosítása
ItemSettings=Elem beállításai
PauseMouseToggling=Egér figyelésének tiltása
blankIcon=Új ikon

[SettingsPanel]
Name=Circle Dock testreszabása
SettingsPanelWord=Beállítások
GeneralWord=Általános
DockShape=Dokk formája

Labels=Címkék
Animation=Animáció
LocationWord=Elhelyezés
TogglingWord=Figyelő mód
FileDockIconAssociations=Fájl-> Dokk ikon társítások
LanguageWord=Nyelv
HelpWord=Súgó
HotKeySelectorToggleDock=Gyorsgomb kiválasztása (To Toggle Dock Visibility)
CtrlWordAbbreviation=Ctrl
AltWordAbbreviation=Alt
ShiftWordAbbreviation=Shift
WindowsKeyWordAbbreviation=Win
ValidHotkeyCombination=Valós gyorsgomb kombináció
InvalidHotKeyCombination=Hibás gyorsgomb kombináció/Már használatban van

CentreAroundCursorWhenShown=Dokk elhelyezése az egérkurzor körül megjelenítéskor
CircleDockVersionWord=Circle Dock Verziója
EnableDockRotation=Dokk elfordulásának engedélyezése

ConfigurationDescriptionLabel=Állítsd be, hogy hogyan jelenjen meg a Circle Dock a képernyőn

// Location Panel
lockDockAtCurrentPosition=Utolsó pozíció megjegyzése
// General Panel
KeepDockAboveAllOtherWindows=Dokk mindig látszik látszik a többi ablak előtt
ClickSensitivity=Kattintási érzékenység
Sensitive=Érzékeny
NotSensitive=Nem érzékeny
EnablePortabilityMode=Hordozható mód engedélyezése
UseMemorySaver=Memóriahasználat csökkentése
useSameRotationValueAllLevels=Minden kör ugyanolyan mértékben forduljon el
currentRotationValue=Elfordulási érték megadása (Radiánban)

// Background Panel
Background=Háttér
BackgroundImage=Háttérkép
NormalSize=Gomb mérete
NormalOpacity=Átlátszóság

// Dock Shape Panel
ConstantNumberOfItemsPerCircle=Meghatározott számú elem egy körön
NumberOfIconsPerCircle=Ikonok száma körönként
MinimumRadius=Minimum hatósugár
SeparationBetweenCircles=Elválasztás a körök között
FormatWord=Formátum
CircleWord=Kör
maximumNumberOfItemsPerCircle=Elemek maximális száma egy körön
lineWord=Vonal
spiralWord=Spirál
rateOfIncrease=Rate of Increase
defaultWord=Alapértelmezett
separationWord=Separation

// Centre Button Panel
CentreButton=Középső nagy gomb
DefaultCentreButton=Középső gomb képe
OtherSettings=Egyéb beállítások
ShowStartMenuWhenClicked=Jelenítse meg a Start Menüt, ha ráklikkelek
StartMenuResidueWarning=Megjegyzés: Kapcsold ki az "Árnyékolás a menük alatt" megjelenítési opciót a Windows-ban, különben előfordulhat, hogy rosszul fog megjelenni az árnyék.

// Dock Items Panel
DockItems=Dokk elemei
RightClickMenu=Jobb-gomb menüje
ShowWindowsFileFolderMenus=Alapértelmezett környezeti menü megjelenítése
HideDock=Dokk elrejtése
HideDockAfterFileExecution=Dokk elrejtése fájl/mappa megnyitása után

// Labels Panel
FontWord=Betűtípus
ChangeFont=Betűtípus módosítása
ChangeColor=Színváltás
ShadowWord=Árnyék
ShadowSize=Árnyék mérete
ShadowDarknessFactor=Árnyék sötétsége
ShowLabels=Címkék megjelenítése
ShowLabelsOnMouseoverOnly=Címkék megjelenítése rámutatáskor

// Animation
AnimationWord=Animáció
GeneralFrameRate=Általános képfrissítés (FPS)
RotationAnimationDuration=Forgatási animáció hossza (ms)
FadeInFadeOutDuration=Átfedések hossza (ms)
UsePoofAnimationWhenDeleting=Animáció megjelenítése törléskor (Kísérleti célból)

//About Panel
AboutWord=Névjegy
ThePremiereCircularDockForWindows=The premiere circular dock for Windows
WebsiteWord=Webhely
VersionInformation=Verzióinformáció
OfficialHomepage=Program honlapja

// Help Panel
SupportWord=Terméktámogatás
OfficialWebForum=Hivatalos fórum
OfficialWebHelpFAQ=Internetes súgó/GyIK

// Language Panel
LanguageFileLocation=Nyelvi fájl helye
LanguageName=Nyelv
LanguageFileAuthor=Nyelvi fájlt készítette
LanguageFileVersion=Nyelvi fájl verziója
LanguageFileOriginallyIntendedFor=A nyelvi fájl a következő Circle Dock verzióhoz készült:
LanguageFileProgramRestartRequired=***Indítsd újra a programot, hogy tökéletesen működjön a nyelvi fájl***
LanguageFileValidCurrent=A nyelvi fájl tökéletes/Friss
LanguageFileInvalidOutofDate=A nyelvi fájl hibás/Elavult

// File -> Icon Associations
FileIconAssocationsDescription=Alapértelmezett ikon megjelenítése fájl/mappa hozzáadásakor a dokkon
FileNameIconAssociations=Fájlnév -> Társított ikon
FolderNameIconAssociations=Könyvtárnév -> Társított ikon
FileExtensionIconAssociations=Kiterjesztés -> Társított ikon
DockFolderIconAssociation=Dokk mappa -> Társított ikon
fileName=Fájlnév
folderName=Könyvtárnév
extensionName=Kiterjesztés
associatedDockIcon=Dokkhoz rendelt ikon
browse=Tallózás
startsWith=Starts With
endsWith=Ends With
exactMatch=Exact
contains=Contains
sample=Sample

// Toggling
ToggleVisibilityHotKey=Figyelt billentyű-kombináció a megjelenítéshez
ToggleVisibilityMouseButton=Figyelt egér gomb a megjelenítéshez
ShowDockWhenIMoveMyMouseTo=Dokk megjelenítése, ha az egeret a képernyő...
ScreenLeftEdge=Bal szélére mozgatom
ScreenRightEdge=Jobb szélére mozgatom
ScreenTopEdge=Tetejére mozgatom
ScreenBottomEdge=Aljára mozgatom
EdgeWidthHeight=Edge Width/Height
dwellTime=Megjelenítés késleltetése

[ErrorMessages]
MissingInvalid=Hiányzik/Hibás
FilePathMissingInvalid=Fájl/Elérési út hiányzik vagy hibás

[DockItemProperties]
ItemSettings=Elem beállításai
IconImage=Megjelenített ikon
Name=Név
Target=Cél
Folder=Mappa.....
File=Fájl.....
StartIn=Indítás
Arguments=Arguments
Run=Futtatás
Normal=Normál méretben
Minimized=Kis méretben
Maximized=Teljes méretben
Close=Bezár